;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)

(package! eshell-bookmark)
(package! doom-themes)
(package! darkroom)
(package! centered-cursor-mode)
(package! exec-path-from-shell)
(package! vagrant)
(package! groovy-mode)
(package! org-pomodoro)
(package! org-brain :recipe (:fetcher github :repo "Kungsgeten/org-brain"))
(package! lorem-ipsum)
(package! simple-httpd)
(package! htmlize)
(package! impatient-mode)
(package! org-caldav :recipe (:fetcher github :repo "dengste/org-caldav"))
